; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	infrared1 - mode
	image0 - mode
	GroundStation1 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star7 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star3 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Phenomenon19 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star18)
	(supports instrument2 image0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 infrared1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star3)
	(supports instrument4 image0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star14)
)
(:goal (and
	(pointing satellite0 Star9)
	(pointing satellite1 Planet12)
	(have_image Planet8 infrared1)
	(have_image Star9 infrared1)
	(have_image Star10 image0)
	(have_image Phenomenon11 image0)
	(have_image Planet12 image0)
	(have_image Phenomenon13 infrared1)
	(have_image Star14 infrared1)
	(have_image Star15 image0)
	(have_image Planet16 image0)
	(have_image Phenomenon17 infrared1)
	(have_image Star18 infrared1)
	(have_image Phenomenon19 image0)
))

)

; plan
1. (turn_to satellite1 planet12 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 planet12)
   goals met: 1 of 14
2. (turn_to satellite0 groundstation0 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 14
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 14
4. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 1 of 14
5. (turn_to satellite0 phenomenon19 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon19)
   goals met: 1 of 14
6. (take_image satellite0 phenomenon19 instrument1 image0)
   added: (have_image phenomenon19 image0)
   goals met: 2 of 14
7. (turn_to satellite0 phenomenon17 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 phenomenon17)
   goals met: 2 of 14
8. (take_image satellite0 phenomenon17 instrument1 infrared1)
   added: (have_image phenomenon17 infrared1)
   goals met: 3 of 14
9. (turn_to satellite0 phenomenon13 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 14
10. (take_image satellite0 phenomenon13 instrument1 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 4 of 14
11. (turn_to satellite0 phenomenon11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 14
12. (take_image satellite0 phenomenon11 instrument1 image0)
   added: (have_image phenomenon11 image0)
   goals met: 5 of 14
13. (turn_to satellite0 planet12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet12)
   goals met: 5 of 14
14. (take_image satellite0 planet12 instrument1 image0)
   added: (have_image planet12 image0)
   goals met: 6 of 14
15. (turn_to satellite0 planet16 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet16)
   goals met: 6 of 14
16. (take_image satellite0 planet16 instrument1 image0)
   added: (have_image planet16 image0)
   goals met: 7 of 14
17. (turn_to satellite0 planet8 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet8)
   goals met: 7 of 14
18. (take_image satellite0 planet8 instrument1 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 8 of 14
19. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 8 of 14
20. (take_image satellite0 star10 instrument1 image0)
   added: (have_image star10 image0)
   goals met: 9 of 14
21. (turn_to satellite0 star14 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star14)
   goals met: 9 of 14
22. (take_image satellite0 star14 instrument1 infrared1)
   added: (have_image star14 infrared1)
   goals met: 10 of 14
23. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 10 of 14
24. (take_image satellite0 star15 instrument1 image0)
   added: (have_image star15 image0)
   goals met: 11 of 14
25. (turn_to satellite0 star18 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star18)
   goals met: 11 of 14
26. (take_image satellite0 star18 instrument1 infrared1)
   added: (have_image star18 infrared1)
   goals met: 12 of 14
27. (turn_to satellite0 star9 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star9)
   goals met: 13 of 14
28. (take_image satellite0 star9 instrument1 infrared1)
   added: (have_image star9 infrared1)
   goals met: 14 of 14
